# Задача 1 Создать метод, который принимает имя пользователя через параметр
# и возвращает строку приветствия пользователя. Например,
# hello, Ivan! или hello, Petr!,
# где Ivan и Petr значения параметра (параметр принимает только одно значение, в примере функция была вызвана дважды)

# def v_name(a):
#     print("Этот метод для вывода имени на консоли  ")
#     name = input("Введи имя которое хотел бы видеть в консоли )) : ")
#     return name
#
# name = None
#
# print(v_name(name))
#
# print(v_name(name))







# # Задача 2 Создать метод, который будет вычислять и возвращать результат выражений:
# # x*x + 2*y, где значения для x и y передаются через параметр в метод.
# # Вычилить результат выражения для x=2, y =3 и x = 1, y = 5 и найти наибольший результат
#
#
# def scheta(a, b):
#     return a * a + 2 * b
#
# # def append_v_list(a):
# #     list = []
# #     list.append(a)
#
# list = []
#
# x = 2
# y = 3
#
# list.append(scheta(x, y))
# # append_v_list(scheta(x, y))
# print('x = 2, y = 3', scheta(x, y))
#
# x = 1
# y = 5
#
# list.append(scheta(x, y))
# # append_v_list(scheta(x, y))
# print('x = 1, y = 5', scheta(x, y))
#
# print(list)
#
# max_value = max(list)
#
# print(max_value)